Opened log file 'C:\windbg.log'
lkd> dt -b _EPROCESS
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Type             : UChar
         +0x001 Abandoned        : UChar
         +0x001 Absolute         : UChar
         +0x001 NpxIrql          : UChar
         +0x001 Signalling       : UChar
         +0x002 Size             : UChar
         +0x002 Hand             : UChar
         +0x003 Inserted         : UChar
         +0x003 DebugActive      : UChar
         +0x003 DpcActive        : UChar
         +0x000 Lock             : Int4B
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
            +0x000 Flink            : Ptr32 
            +0x004 Blink            : Ptr32 
      +0x010 ProfileListHead  : _LIST_ENTRY
         +0x000 Flink            : Ptr32 
         +0x004 Blink            : Ptr32 
      +0x018 DirectoryTableBase : Uint4B
      +0x01c Unused0          : Uint4B
      +0x020 LdtDescriptor    : _KGDTENTRY
         +0x000 LimitLow         : Uint2B
         +0x002 BaseLow          : Uint2B
         +0x004 HighWord         : <unnamed-tag>
            +0x000 Bytes            : <unnamed-tag>
               +0x000 BaseMid          : UChar
               +0x001 Flags1           : UChar
               +0x002 Flags2           : UChar
               +0x003 BaseHi           : UChar
            +0x000 Bits             : <unnamed-tag>
               +0x000 BaseMid          : Pos 0, 8 Bits
               +0x000 Type             : Pos 8, 5 Bits
               +0x000 Dpl              : Pos 13, 2 Bits
               +0x000 Pres             : Pos 15, 1 Bit
               +0x000 LimitHi          : Pos 16, 4 Bits
               +0x000 Sys              : Pos 20, 1 Bit
               +0x000 Reserved_0       : Pos 21, 1 Bit
               +0x000 Default_Big      : Pos 22, 1 Bit
               +0x000 Granularity      : Pos 23, 1 Bit
               +0x000 BaseHi           : Pos 24, 8 Bits
      +0x028 Int21Descriptor  : _KIDTENTRY
         +0x000 Offset           : Uint2B
         +0x002 Selector         : Uint2B
         +0x004 Access           : Uint2B
         +0x006 ExtendedOffset   : Uint2B
      +0x030 IopmOffset       : Uint2B
      +0x032 Unused1          : UChar
      +0x033 Unused2          : UChar
      +0x034 ActiveProcessors : Uint4B
      +0x038 KernelTime       : Uint4B
      +0x03c UserTime         : Uint4B
      +0x040 ReadyListHead    : _LIST_ENTRY
         +0x000 Flink            : Ptr32 
         +0x004 Blink            : Ptr32 
      +0x048 SwapListEntry    : _SINGLE_LIST_ENTRY
         +0x000 Next             : Ptr32 
      +0x04c VdmTrapcHandler  : Ptr32 
      +0x050 ThreadListHead   : _LIST_ENTRY
         +0x000 Flink            : Ptr32 
         +0x004 Blink            : Ptr32 
      +0x058 ProcessLock      : Uint4B
      +0x05c Affinity         : Uint4B
      +0x060 AutoAlignment    : Pos 0, 1 Bit
      +0x060 DisableBoost     : Pos 1, 1 Bit
      +0x060 DisableQuantum   : Pos 2, 1 Bit
      +0x060 ReservedFlags    : Pos 3, 29 Bits
      +0x060 ProcessFlags     : Int4B
      +0x064 BasePriority     : Char
      +0x065 QuantumReset     : Char
      +0x066 State            : UChar
      +0x067 ThreadSeed       : UChar
      +0x068 PowerState       : UChar
      +0x069 IdealNode        : UChar
      +0x06a Visited          : UChar
      +0x06b Flags            : _KEXECUTE_OPTIONS
         +0x000 ExecuteDisable   : Pos 0, 1 Bit
         +0x000 ExecuteEnable    : Pos 1, 1 Bit
         +0x000 DisableThunkEmulation : Pos 2, 1 Bit
         +0x000 Permanent        : Pos 3, 1 Bit
         +0x000 ExecuteDispatchEnable : Pos 4, 1 Bit
         +0x000 ImageDispatchEnable : Pos 5, 1 Bit
         +0x000 DisableExceptionChainValidation : Pos 6, 1 Bit
         +0x000 Spare            : Pos 7, 1 Bit
      +0x06b ExecuteOptions   : UChar
      +0x06c StackCount       : Uint4B
      +0x070 ProcessListEntry : _LIST_ENTRY
         +0x000 Flink            : Ptr32 
         +0x004 Blink            : Ptr32 
      +0x078 CycleTime        : Uint8B
   +0x080 ProcessLock      : _EX_PUSH_LOCK
      +0x000 Locked           : Pos 0, 1 Bit
      +0x000 Waiting          : Pos 1, 1 Bit
      +0x000 Waking           : Pos 2, 1 Bit
      +0x000 MultipleShared   : Pos 3, 1 Bit
      +0x000 Shared           : Pos 4, 28 Bits
      +0x000 Value            : Uint4B
      +0x000 Ptr              : Ptr32 
   +0x088 CreateTime       : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x090 ExitTime         : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x098 RundownProtect   : _EX_RUNDOWN_REF
      +0x000 Count            : Uint4B
      +0x000 Ptr              : Ptr32 
   +0x09c UniqueProcessId  : Ptr32 
   +0x0a0 ActiveProcessLinks : _LIST_ENTRY
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x0a8 QuotaUsage       : Uint4B
   +0x0b4 QuotaPeak        : Uint4B
   +0x0c0 CommitCharge     : Uint4B
   +0x0c4 PeakVirtualSize  : Uint4B
   +0x0c8 VirtualSize      : Uint4B
   +0x0cc SessionProcessLinks : _LIST_ENTRY
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x0d4 DebugPort        : Ptr32 
   +0x0d8 ExceptionPortData : Ptr32 
   +0x0d8 ExceptionPortValue : Uint4B
   +0x0d8 ExceptionPortState : Pos 0, 3 Bits
   +0x0dc ObjectTable      : Ptr32 
   +0x0e0 Token            : _EX_FAST_REF
      +0x000 Object           : Ptr32 
      +0x000 RefCnt           : Pos 0, 3 Bits
      +0x000 Value            : Uint4B
   +0x0e4 WorkingSetPage   : Uint4B
   +0x0e8 AddressCreationLock : _EX_PUSH_LOCK
      +0x000 Locked           : Pos 0, 1 Bit
      +0x000 Waiting          : Pos 1, 1 Bit
      +0x000 Waking           : Pos 2, 1 Bit
      +0x000 MultipleShared   : Pos 3, 1 Bit
      +0x000 Shared           : Pos 4, 28 Bits
      +0x000 Value            : Uint4B
      +0x000 Ptr              : Ptr32 
   +0x0ec RotateInProgress : Ptr32 
   +0x0f0 ForkInProgress   : Ptr32 
   +0x0f4 HardwareTrigger  : Uint4B
   +0x0f8 PhysicalVadRoot  : Ptr32 
   +0x0fc CloneRoot        : Ptr32 
   +0x100 NumberOfPrivatePages : Uint4B
   +0x104 NumberOfLockedPages : Uint4B
   +0x108 Win32Process     : Ptr32 
   +0x10c Job              : Ptr32 
   +0x110 SectionObject    : Ptr32 
   +0x114 SectionBaseAddress : Ptr32 
   +0x118 QuotaBlock       : Ptr32 
   +0x11c WorkingSetWatch  : Ptr32 
   +0x120 Win32WindowStation : Ptr32 
   +0x124 InheritedFromUniqueProcessId : Ptr32 
   +0x128 LdtInformation   : Ptr32 
   +0x12c Spare            : Ptr32 
   +0x130 VdmObjects       : Ptr32 
   +0x134 DeviceMap        : Ptr32 
   +0x138 EtwDataSource    : Ptr32 
   +0x13c FreeTebHint      : Ptr32 
   +0x140 PageDirectoryPte : _HARDWARE_PTE_X86
      +0x000 Valid            : Pos 0, 1 Bit
      +0x000 Write            : Pos 1, 1 Bit
      +0x000 Owner            : Pos 2, 1 Bit
      +0x000 WriteThrough     : Pos 3, 1 Bit
      +0x000 CacheDisable     : Pos 4, 1 Bit
      +0x000 Accessed         : Pos 5, 1 Bit
      +0x000 Dirty            : Pos 6, 1 Bit
      +0x000 LargePage        : Pos 7, 1 Bit
      +0x000 Global           : Pos 8, 1 Bit
      +0x000 CopyOnWrite      : Pos 9, 1 Bit
      +0x000 Prototype        : Pos 10, 1 Bit
      +0x000 reserved         : Pos 11, 1 Bit
      +0x000 PageFrameNumber  : Pos 12, 20 Bits
   +0x140 Filler           : Uint8B
   +0x148 Session          : Ptr32 
   +0x14c ImageFileName    : UChar
   +0x15c JobLinks         : _LIST_ENTRY
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x164 LockedPagesList  : Ptr32 
   +0x168 ThreadListHead   : _LIST_ENTRY
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x170 SecurityPort     : Ptr32 
   +0x174 PaeTop           : Ptr32 
   +0x178 ActiveThreads    : Uint4B
   +0x17c ImagePathHash    : Uint4B
   +0x180 DefaultHardErrorProcessing : Uint4B
   +0x184 LastThreadExitStatus : Int4B
   +0x188 Peb              : Ptr32 
   +0x18c PrefetchTrace    : _EX_FAST_REF
      +0x000 Object           : Ptr32 
      +0x000 RefCnt           : Pos 0, 3 Bits
      +0x000 Value            : Uint4B
   +0x190 ReadOperationCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x198 WriteOperationCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x1a0 OtherOperationCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x1a8 ReadTransferCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x1b0 WriteTransferCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x1b8 OtherTransferCount : _LARGE_INTEGER
      +0x000 LowPart          : Uint4B
      +0x004 HighPart         : Int4B
      +0x000 u                : <unnamed-tag>
         +0x000 LowPart          : Uint4B
         +0x004 HighPart         : Int4B
      +0x000 QuadPart         : Int8B
   +0x1c0 CommitChargeLimit : Uint4B
   +0x1c4 CommitChargePeak : Uint4B
   +0x1c8 AweInfo          : Ptr32 
   +0x1cc SeAuditProcessCreationInfo : _SE_AUDIT_PROCESS_CREATION_INFO
      +0x000 ImageFileName    : Ptr32 
   +0x1d0 Vm               : _MMSUPPORT
      +0x000 WorkingSetExpansionLinks : _LIST_ENTRY
         +0x000 Flink            : Ptr32 
         +0x004 Blink            : Ptr32 
      +0x008 LastTrimStamp    : Uint2B
      +0x00a NextPageColor    : Uint2B
      +0x00c Flags            : _MMSUPPORT_FLAGS
         +0x000 SessionSpace     : Pos 0, 1 Bit
         +0x000 ModwriterAttached : Pos 1, 1 Bit
         +0x000 TrimHard         : Pos 2, 1 Bit
         +0x000 MaximumWorkingSetHard : Pos 3, 1 Bit
         +0x000 ForceTrim        : Pos 4, 1 Bit
         +0x000 MinimumWorkingSetHard : Pos 5, 1 Bit
         +0x000 SessionMaster    : Pos 6, 1 Bit
         +0x000 TrimmerAttached  : Pos 7, 1 Bit
         +0x001 TrimmerDetaching : Pos 0, 1 Bit
         +0x001 Reserved         : Pos 1, 3 Bits
         +0x001 PageStealers     : Pos 4, 4 Bits
         +0x002 MemoryPriority   : Pos 0, 8 Bits
         +0x003 WsleDeleted      : Pos 0, 1 Bit
         +0x003 VmExiting        : Pos 1, 1 Bit
         +0x003 ExpansionFailed  : Pos 2, 1 Bit
         +0x003 Available        : Pos 3, 5 Bits
      +0x010 PageFaultCount   : Uint4B
      +0x014 PeakWorkingSetSize : Uint4B
      +0x018 ChargedWslePages : Uint4B
      +0x01c MinimumWorkingSetSize : Uint4B
      +0x020 MaximumWorkingSetSize : Uint4B
      +0x024 VmWorkingSetList : Ptr32 
      +0x028 Claim            : Uint4B
      +0x02c ActualWslePages  : Uint4B
      +0x030 WorkingSetPrivateSize : Uint4B
      +0x034 WorkingSetSizeOverhead : Uint4B
      +0x038 WorkingSetSize   : Uint4B
      +0x03c ExitGate         : Ptr32 
      +0x040 WorkingSetMutex  : _EX_PUSH_LOCK
         +0x000 Locked           : Pos 0, 1 Bit
         +0x000 Waiting          : Pos 1, 1 Bit
         +0x000 Waking           : Pos 2, 1 Bit
         +0x000 MultipleShared   : Pos 3, 1 Bit
         +0x000 Shared           : Pos 4, 28 Bits
         +0x000 Value            : Uint4B
         +0x000 Ptr              : Ptr32 
      +0x044 AccessLog        : Ptr32 
   +0x218 MmProcessLinks   : _LIST_ENTRY
      +0x000 Flink            : Ptr32 
      +0x004 Blink            : Ptr32 
   +0x220 ModifiedPageCount : Uint4B
   +0x224 Flags2           : Uint4B
   +0x224 JobNotReallyActive : Pos 0, 1 Bit
   +0x224 AccountingFolded : Pos 1, 1 Bit
   +0x224 NewProcessReported : Pos 2, 1 Bit
   +0x224 ExitProcessReported : Pos 3, 1 Bit
   +0x224 ReportCommitChanges : Pos 4, 1 Bit
   +0x224 LastReportMemory : Pos 5, 1 Bit
   +0x224 ReportPhysicalPageChanges : Pos 6, 1 Bit
   +0x224 HandleTableRundown : Pos 7, 1 Bit
   +0x224 NeedsHandleRundown : Pos 8, 1 Bit
   +0x224 RefTraceEnabled  : Pos 9, 1 Bit
   +0x224 NumaAware        : Pos 10, 1 Bit
   +0x224 ProtectedProcess : Pos 11, 1 Bit
   +0x224 DefaultPagePriority : Pos 12, 3 Bits
   +0x224 PrimaryTokenFrozen : Pos 15, 1 Bit
   +0x224 ProcessVerifierTarget : Pos 16, 1 Bit
   +0x224 StackRandomizationDisabled : Pos 17, 1 Bit
   +0x224 AffinityPermanent : Pos 18, 1 Bit
   +0x224 AffinityUpdateEnable : Pos 19, 1 Bit
   +0x224 CrossSessionCreate : Pos 20, 1 Bit
   +0x228 Flags            : Uint4B
   +0x228 CreateReported   : Pos 0, 1 Bit
   +0x228 NoDebugInherit   : Pos 1, 1 Bit
   +0x228 ProcessExiting   : Pos 2, 1 Bit
   +0x228 ProcessDelete    : Pos 3, 1 Bit
   +0x228 Wow64SplitPages  : Pos 4, 1 Bit
   +0x228 VmDeleted        : Pos 5, 1 Bit
   +0x228 OutswapEnabled   : Pos 6, 1 Bit
   +0x228 Outswapped       : Pos 7, 1 Bit
   +0x228 ForkFailed       : Pos 8, 1 Bit
   +0x228 Wow64VaSpace4Gb  : Pos 9, 1 Bit
   +0x228 AddressSpaceInitialized : Pos 10, 2 Bits
   +0x228 SetTimerResolution : Pos 12, 1 Bit
   +0x228 BreakOnTermination : Pos 13, 1 Bit
   +0x228 DeprioritizeViews : Pos 14, 1 Bit
   +0x228 WriteWatch       : Pos 15, 1 Bit
   +0x228 ProcessInSession : Pos 16, 1 Bit
   +0x228 OverrideAddressSpace : Pos 17, 1 Bit
   +0x228 HasAddressSpace  : Pos 18, 1 Bit
   +0x228 LaunchPrefetched : Pos 19, 1 Bit
   +0x228 InjectInpageErrors : Pos 20, 1 Bit
   +0x228 VmTopDown        : Pos 21, 1 Bit
   +0x228 ImageNotifyDone  : Pos 22, 1 Bit
   +0x228 PdeUpdateNeeded  : Pos 23, 1 Bit
   +0x228 VdmAllowed       : Pos 24, 1 Bit
   +0x228 SmapAllowed      : Pos 25, 1 Bit
   +0x228 ProcessInserted  : Pos 26, 1 Bit
   +0x228 DefaultIoPriority : Pos 27, 3 Bits
   +0x228 ProcessSelfDelete : Pos 30, 1 Bit
   +0x228 SpareProcessFlags : Pos 31, 1 Bit
   +0x22c ExitStatus       : Int4B
   +0x230 Spare7           : Uint2B
   +0x232 SubSystemMinorVersion : UChar
   +0x233 SubSystemMajorVersion : UChar
   +0x232 SubSystemVersion : Uint2B
   +0x234 PriorityClass    : UChar
   +0x238 VadRoot          : _MM_AVL_TABLE
      +0x000 BalancedRoot     : _MMADDRESS_NODE
         +0x000 u1               : <unnamed-tag>
            +0x000 Balance          : Pos 0, 2 Bits
            +0x000 Parent           : Ptr32 
         +0x004 LeftChild        : Ptr32 
         +0x008 RightChild       : Ptr32 
         +0x00c StartingVpn      : Uint4B
         +0x010 EndingVpn        : Uint4B
      +0x014 DepthOfTree      : Pos 0, 5 Bits
      +0x014 Unused           : Pos 5, 3 Bits
      +0x014 NumberGenericTableElements : Pos 8, 24 Bits
      +0x018 NodeHint         : Ptr32 
      +0x01c NodeFreeHint     : Ptr32 
   +0x258 Cookie           : Uint4B
   +0x25c AlpcContext      : _ALPC_PROCESS_CONTEXT
      +0x000 Lock             : _EX_PUSH_LOCK
         +0x000 Locked           : Pos 0, 1 Bit
         +0x000 Waiting          : Pos 1, 1 Bit
         +0x000 Waking           : Pos 2, 1 Bit
         +0x000 MultipleShared   : Pos 3, 1 Bit
         +0x000 Shared           : Pos 4, 28 Bits
         +0x000 Value            : Uint4B
         +0x000 Ptr              : Ptr32 
      +0x004 ViewListHead     : _LIST_ENTRY
         +0x000 Flink            : Ptr32 
         +0x004 Blink            : Ptr32 
      +0x00c PagedPoolQuotaCache : Uint4B
